In [1]:
import pandas as pd

In [2]:
uriage_data = pd.read_csv('../data100/uriage.csv')
kokyaku_data = pd.read_excel('../data100/kokyaku_daicho.xlsx')

In [3]:
uriage_data.head()

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05     상 품 S         NaN           김우찬
2  2019-05-11 19:42     상 품 a         NaN           김유찬
3  2019-02-12 23:40       상품Z      2600.0           김재현
4   2019-04-22 3:09       상품a         NaN           김강현

In [4]:
uriage_data.item_name = uriage_data.item_name.str.upper()
uriage_data.item_name = uriage_data.item_name.str.replace(' ','')

In [5]:
uriage_data.head()

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05       상품S         NaN           김우찬
2  2019-05-11 19:42       상품A         NaN           김유찬
3  2019-02-12 23:40       상품Z      2600.0           김재현
4   2019-04-22 3:09       상품A         NaN           김강현

In [6]:
flg_is_null = uriage_data.item_price.isna()

In [7]:
for trg in list(uriage_data.loc[flg_is_null,'item_name'].unique()):
    price = uriage_data.loc[(~flg_is_null)&(uriage_data.item_name==trg),'item_price'].max()
    uriage_data.loc[(flg_is_null)&(uriage_data.item_name==trg),'item_price'] = price
    pass

In [8]:
uriage_data.head()

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05       상품S      1900.0           김우찬
2  2019-05-11 19:42       상품A       100.0           김유찬
3  2019-02-12 23:40       상품Z      2600.0           김재현
4   2019-04-22 3:09       상품A       100.0           김강현

In [9]:
kokyaku_data.head()

   고객이름  지역                  등록일
0  김 현성  H시  2018-01-04 00:00:00
1  김 도윤  E시                42782
2  김 지한  A시  2018-01-07 00:00:00
3  김 하윤  F시                42872
4  김 시온  E시                43127

In [10]:
uriage_data.head()

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05       상품S      1900.0           김우찬
2  2019-05-11 19:42       상품A       100.0           김유찬
3  2019-02-12 23:40       상품Z      2600.0           김재현
4   2019-04-22 3:09       상품A       100.0           김강현

In [11]:
kokyaku_data.고객이름 = kokyaku_data.고객이름.str.replace(' ','')

In [13]:
kokyaku_data['고객이름'] = kokyaku_data['고객이름'].str.replace('  ','')

In [12]:
kokyaku_data.head()

  고객이름  지역                  등록일
0  김현성  H시  2018-01-04 00:00:00
1  김도윤  E시                42782
2  김지한  A시  2018-01-07 00:00:00
3  김하윤  F시                42872
4  김시온  E시                43127

In [15]:
kokyaku_data.shape

(200, 3)

In [16]:
flg_is_serial = kokyaku_data['등록일'].astype('str').str.isdigit()

In [18]:
flg_is_serial.sum()

np.int64(22)

In [20]:
kokyaku_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   고객이름    200 non-null    object
 1   지역      200 non-null    object
 2   등록일     200 non-null    object
dtypes: object(3)
memory usage: 4.8+ KB

In [41]:
fromSerial = pd.to_timedelta(kokyaku_data.loc[flg_is_serial,'등록일'].astype('float'), unit='D')+pd.to_datetime('1900/01/01')

In [42]:
fromSerial

1     2017-02-18
3     2017-05-19
4     2018-01-29
21    2017-07-06
27    2017-06-17
47    2017-01-08
49    2017-07-15
53    2017-04-10
76    2018-03-31
80    2018-01-12
99    2017-06-01
114   2018-06-05
118   2018-01-31
122   2018-04-18
139   2017-05-27
143   2017-03-26
155   2017-01-21
172   2018-03-24
179   2017-01-10
183   2017-07-26
186   2018-07-15
192   2018-06-10
Name: 등록일, dtype: datetime64[ns]

In [43]:
fromString = pd.to_datetime(kokyaku_data.loc[~flg_is_serial,'등록일'])

In [44]:
fromString

0     2018-01-04
2     2018-01-07
5     2017-06-20
6     2018-06-11
7     2017-05-19
         ...
195   2017-06-20
196   2018-06-20
197   2017-04-29
198   2019-04-19
199   2019-04-23
Name: 등록일, Length: 178, dtype: datetime64[ns]

In [45]:
kokyaku_data['등록일'] = pd.concat([fromSerial,fromString])

In [46]:
kokyaku_data.head()

  고객이름  지역        등록일
0  김현성  H시 2018-01-04
1  김도윤  E시 2017-02-18
2  김지한  A시 2018-01-07
3  김하윤  F시 2017-05-19
4  김시온  E시 2018-01-29

In [47]:
kokyaku_data['등록연월'] = kokyaku_data['등록일'].dt.strftime('%Y%m')

In [49]:
rslt = kokyaku_data.groupby('등록연월')['고객이름'].count()

In [50]:
print(rslt)

등록연월
201701    15
201702    11
201703    14
201704    15
201705    13
201706    14
201707    17
201801    13
201802    15
201803    17
201804     5
201805    19
201806    13
201807    17
201904     2
Name: 고객이름, dtype: int64

In [52]:
join_data = pd.merge(uriage_data, kokyaku_data, 
         left_on='customer_name',right_on='고객이름', how='left')

In [53]:
join_data = join_data.drop('customer_name',axis=1)

In [54]:
join_data.head()

      purchase_date item_name  item_price 고객이름  지역        등록일    등록연월
0  2019-06-13 18:02       상품A       100.0  김가온  C시 2017-01-26  201701
1  2019-07-13 13:05       상품S      1900.0  김우찬  C시 2018-04-07  201804
2  2019-05-11 19:42       상품A       100.0  김유찬  A시 2018-06-19  201806
3  2019-02-12 23:40       상품Z      2600.0  김재현  D시 2018-07-22  201807
4   2019-04-22 3:09       상품A       100.0  김강현  D시 2017-06-07  201706

In [56]:
dump_data = join_data[['purchase_date','item_name','item_price','고객이름','지역','등록일']]

In [57]:
dump_data.head()

      purchase_date item_name  item_price 고객이름  지역        등록일
0  2019-06-13 18:02       상품A       100.0  김가온  C시 2017-01-26
1  2019-07-13 13:05       상품S      1900.0  김우찬  C시 2018-04-07
2  2019-05-11 19:42       상품A       100.0  김유찬  A시 2018-06-19
3  2019-02-12 23:40       상품Z      2600.0  김재현  D시 2018-07-22
4   2019-04-22 3:09       상품A       100.0  김강현  D시 2017-06-07

In [58]:
dump_data.to_csv('../data100/dump_data.csv',index=False)